[{"url":"avanquest.com","img":"avanquest.gif","description":"<p>All in all, I spent 7 years developing this website for a former employer.</p>\r\n<p>The site is composed of 2 parts:</p>\r\n<ul>\r\n<li>Catalogue</li>\r\n<li>Shop</p>\r\n</ul>\r\n<p>Main brunt of my work was in the Catalogue as we integrated Joomla's data storage into it's front end without utilizing the CMS's front end capabilities. Before this, I was also involved in the integration in the company's previous CMS, which was Tridion.</p>\r\n<p>I was also instrumental in the integration of serveral different payment methods into the Shop and also helped develop/maintain the Shop's back office.</p> "},{"url":"softcity.com","img":"softcity.gif","description":"<p>I was employed to maintain/develop the site which was handed down to me from a team of developers that were based in Montreal, Canada.</p><p>Once upon a time, it had it's own e-commerce platform, but the decision was made to integrate this function with another cart also managed by that particular company.</p><p>The site is built using Zend Framework 1, LAMP and Apache SOLR which is employed to manage searches.</p>"},{"url":"scoreguru.co.uk","img":"scoreguru.gif","description":"<p>Myself and a friend developed this as we felt that in the world of sports results prediction's games it was lacking a certain something. From past experience, these types of games were managed merely by macro enabled Excel spreadsheets and I thought this could be managed by a web application.</p><p>So after previous versions, we developed this ScoreGuru. I took care of the backend/javascript, and my partner looked after the HTML & CSS.</p><p>Backend is developed using Zend Framework 1 and LAMP.</p><p>The site is designed responsive & also features a sister iPhone app which was installed only on my device which helped me manage the admin and my predictions.</p>"},{"url":"novadevelopment.com","img":"novadevelopment.gif","description":"<p>Helped Develop/maintain this site for a past employer.</p><p>The data is managed by Joomla backend, and the front end is a custom built framework which merely taps into Joomla's data storage to render the content.</p>"},{"url":"gymspot.co.uk","img":"gymspot.gif","description":"<p>I have an active interest in fitness and teamed up with a friend to develop this blog.</p><p>The blog is managed by Wordpress and the affiliate portal is developed using CakePHP.</p><p>I am actively searching for a dedicated fitness fanatic to reboot this site with fresh content and a new design.</p>"},{"url":"SoftCityApp","img":"softcityApp.png","description":"<p>I inherited this app in former role. The app gets its data from a HTTP API and enables caching to speed up the perforance when there is no data connection.</p><p>I was able to develop the app further and created features such as:</p><ul><li>A signup page</li><li>Support section</li><li>Rot-able views</li></ul><p>Since I left this employer, the app has been taken off the app store therefore I am not able to provide a link.</p>"},{"url":"sunny.co.uk","img":"sunny.gif","description":"<p>For the past 1.5 years, I have been developing both frontend and backend features on sunny.co.uk.</p>\n<p>The highlights were:</p>\n<ul>\n<li>Developed the calculator widget using jquery/ajax/localstorage</li>\n<li>Built a bespoke backend driven A/B testing feature using PHP/MySQL</li>\n<li>Redesigning of the customer area</li>\n<li>Integration of native and third party webservices</li>\n</ul>"}]